Revit 2027 API
AdvancedWood.WoodDiffusePerlinScaleZ Property
 The property labeled "Anisotropic pos-z scale for diffuse albedo perlin" from the "AdvancedWood" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string WoodDiffusePerlinScaleZ { get; }
Public Shared ReadOnly Property WoodDiffusePerlinScaleZ As String
	Get
public:
static property String^ WoodDiffusePerlinScaleZ {
	String^ get ();
}
static member WoodDiffusePerlinScaleZ : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyDouble".
See Also
Reference
AdvancedWood Class
Autodesk.Revit.DB.Visual Namespace